<?php

namespace App\Card;

class CardGraphic extends Card
{
    public function __construct($value = null)
    {
        parent::__construct($value);
    }

    // public function __construct($value = null, $suit = null)
    // {
    //     parent::__construct($value, $suit);
    // }

    // private $hearts = [
    //     "🂱", "🂲", "🂳", "🂴", "🂵", "🂶", "🂷", "🂸", "🂹", "🂺", "🂻", "🂽", "🂾"
    // ];

    // private $diamonds = [
    //     "🃁", "🃂", "🃃", "🃄", "🃅", "🃆", "🃇", "🃈", "🃉", "🃊", "🃋", "🃍", "🃎"
    // ];

    // private $spades = [
    //     "🂡", "🂢", "🂣", "🂤", "🂥", "🂦", "🂧", "🂨", "🂩", "🂪", "🂫", "🂭", "🂮"
    // ];

    // private $clubs = [
    //     "🃑", "🃒", "🃓", "🃔", "🃕", "🃖", "🃗", "🃘", "🃙", "🃚", "🃛", "🃝", "🃞"
    // ];

    public $deckOfCards = [
        "🂱", "🂲", "🂳", "🂴", "🂵", "🂶", "🂷", "🂸", "🂹", "🂺", "🂻", "🂽", "🂾",
        "🃁", "🃂", "🃃", "🃄", "🃅", "🃆", "🃇", "🃈", "🃉", "🃊", "🃋", "🃍", "🃎",
        "🂡", "🂢", "🂣", "🂤", "🂥", "🂦", "🂧", "🂨", "🂩", "🂪", "🂫", "🂭", "🂮",
        "🃑", "🃒", "🃓", "🃔", "🃕", "🃖", "🃗", "🃘", "🃙", "🃚", "🃛", "🃝", "🃞"
    ];

    public function getAsString(): string
    {
        return $this->deckOfCards[$this->value - 1];
    }
}
